[
  {
    "Muscles": "Biceps",
    "WorkOut": "Preview Barbell Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell",
    "Explaination": "Barbell Curl: Stand with feet shoulder-width apart, hold a barbell with an underhand grip and curl it towards your shoulders.",
    "Long Explanation": "This classic bicep-building exercise involves standing with feet shoulder-width apart, gripping a barbell with an underhand grip. With elbows close to the torso, curl the barbell towards the shoulders while keeping the upper arms stationary. This motion targets the bicep muscles, including both the long and short head, providing development in muscle mass and arm strength. The focus is on smooth, controlled movements, exhaling as you lift the barbell and inhaling on the return. For beginners, it's crucial to start with a lighter weight to perfect the form before progressing.",
    "Video": "https://www.youtube.com/results?search_query=Barbell+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Dumbbell Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbells",
    "Explaination": "Dumbbell Curl: Curl dumbbells alternately or simultaneously while keeping your elbows close to your torso.",
    "Long Explanation": "The Dumbbell Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Dumbbell+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Hammer Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbells",
    "Explaination": "Hammer Curl: Perform dumbbell curls with palms facing each other, targeting the brachialis muscle.",
    "Long Explanation": "The Hammer Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Hammer+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Preacher Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Preacher bench and barbell or dumbbell",
    "Explaination": "Preacher Curl: Use a preacher bench to isolate biceps, keeping the upper arms stationary.",
    "Long Explanation": "The Preacher Curl is a weight training exercise targeting the Biceps. It involves using Preacher bench and barbell or dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Preacher+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Concentration Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbell",
    "Explaination": "Concentration Curl: Sit with a dumbbell in one hand, elbow on the thigh, and curl the weight focusing on the bicep.",
    "Long Explanation": "The Concentration Curl is a weight training exercise targeting the Biceps. It involves using Dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Concentration+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Cable Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Cable machine with bar attachment",
    "Explaination": "Cable Curl: Use a cable machine with a bar attachment, curling the bar towards your chest.",
    "Long Explanation": "The Cable Curl is a weight training exercise targeting the Biceps. It involves using Cable machine with bar attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Cable+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "EZ-Bar Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "EZ-bar",
    "Explaination": "EZ-Bar Curl: Curl an EZ-bar with both hands, which can be easier on your wrists.",
    "Long Explanation": "The EZ-Bar Curl is a weight training exercise targeting the Biceps. It involves using EZ-bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=EZ-Bar+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Incline Dumbbell Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbells and an incline bench",
    "Explaination": "Incline Dumbbell Curl: Lie back on an incline bench, curl dumbbells with arms hanging down.",
    "Long Explanation": "The Incline Dumbbell Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells and an incline bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Incline+Dumbbell+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Reverse Barbell Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell",
    "Explaination": "Reverse Barbell Curl: Grip the barbell overhand and curl, targeting the forearms and biceps.",
    "Long Explanation": "The Reverse Barbell Curl is a weight training exercise targeting the Biceps. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Reverse+Barbell+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Seated Alternating Dumbbell Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbells and a bench",
    "Explaination": "Seated Alternating Dumbbell Curl: Alternate curling dumbbells while seated, focusing on each bicep.",
    "Long Explanation": "The Seated Alternating Dumbbell Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells and a bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Seated+Alternating+Dumbbell+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Zottman Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbells",
    "Explaination": "Zottman Curl: Curl dumbbells up normally and rotate your wrists at the top to descend with an overhand grip.",
    "Long Explanation": "The Zottman Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Zottman+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Resistance Band Bicep Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Resistance band",
    "Explaination": "Resistance Band Bicep Curl: Stand on a resistance band and curl your hands towards your shoulders.",
    "Long Explanation": "The Resistance Band Bicep Curl is a weight training exercise targeting the Biceps. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Bicep+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Chin-Up",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Pull-up bar",
    "Explaination": "Chin-Up: Grip a bar with palms facing you and pull yourself up, focusing on biceps.",
    "Long Explanation": "The Chin-Up is a weight training exercise targeting the Biceps. It involves using Pull-up bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Chin-Up"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Machine Bicep Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Bicep curl machine",
    "Explaination": "Machine Bicep Curl: Use a bicep curl machine, focusing on isolating the bicep muscle.",
    "Long Explanation": "The Machine Bicep Curl is a weight training exercise targeting the Biceps. It involves using Bicep curl machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Machine+Bicep+Curl"
  },
  {
    "Muscles": "Biceps",
    "WorkOut": "Spider Curl",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Bench (preferably inclined) and barbell or dumbbells",
    "Explaination": "Spider Curl: Lie face down on an incline bench and curl barbells, isolating biceps.",
    "Long Explanation": "The Spider Curl is a weight training exercise targeting the Biceps. It involves using Bench (preferably inclined) and barbell or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Spider+Curl"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Tricep Dips",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Parallel bars or a bench",
    "Explaination": "Tricep Dips: Use parallel bars or a bench, lower your body by bending your arms, then push back up.",
    "Long Explanation": "The Tricep Dips is a weight training exercise targeting the Triceps. It involves using Parallel bars or a bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Tricep+Dips"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Skull Crushers (Lying Tricep Extensions)",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell or dumbbells and a bench",
    "Explaination": "Skull Crushers (Lying Tricep Extensions): Lie on a bench, extend arms with weight, lower it towards your forehead, then extend back up.",
    "Long Explanation": "The Skull Crushers (Lying Tricep Extensions) is a weight training exercise targeting the Triceps. It involves using Barbell or dumbbells and a bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Skull+Crushers"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Close-Grip Bench Press",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell or dumbbells",
    "Explaination": "Close-Grip Bench Press: Bench press with hands closer together, focusing on triceps more than chest.",
    "Long Explanation": "The Close-Grip Bench Press is a weight training exercise targeting the Triceps. It involves using Barbell or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Close-Grip+Bench+Press"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Overhead Tricep Extension",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbell or kettlebell",
    "Explaination": "Overhead Tricep Extension: Stand or sit, extend a weight over your head, then bend and straighten your elbows.",
    "Long Explanation": "The Overhead Tricep Extension is a weight training exercise targeting the Triceps. It involves using Dumbbell or kettlebell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Overhead+Tricep+Extension"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Tricep Pushdown",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Cable machine with bar attachment",
    "Explaination": "Tricep Pushdown: On a cable machine, push the bar down until arms are extended, focusing on triceps.",
    "Long Explanation": "The Tricep Pushdown is a weight training exercise targeting the Triceps. It involves using Cable machine with bar attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Tricep+Pushdown"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Diamond Push-Ups",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Diamond Push-Ups: Place hands close together in a diamond shape, lower your body, and push up, targeting triceps.",
    "Long Explanation": "The Diamond Push-Ups is a weight training exercise targeting the Triceps. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Diamond+Push-Ups"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Cable Overhead Tricep Extension",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Cable machine with rope attachment",
    "Explaination": "Cable Overhead Tricep Extension: Face away from a cable machine, extend arms overhead, and bend/extend your elbows.",
    "Long Explanation": "The Cable Overhead Tricep Extension is a weight training exercise targeting the Triceps. It involves using Cable machine with rope attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Cable+Overhead+Tricep+Extension"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Single-Arm Dumbbell Extension",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbell",
    "Explaination": "Single-Arm Dumbbell Extension: Overhead extension using a dumbbell, performed one arm at a time for focused tricep work.",
    "Long Explanation": "The Single-Arm Dumbbell Extension is a weight training exercise targeting the Triceps. It involves using Dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Single-Arm+Dumbbell+Extension"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Kickbacks",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbell",
    "Explaination": "Kickbacks: Lean forward, move a dumbbell back until your arm is straight, focusing on the tricep.",
    "Long Explanation": "The Kickbacks is a weight training exercise targeting the Triceps. It involves using Dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Kickbacks"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Rope Pushdown",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Cable machine with rope attachment",
    "Explaination": "Rope Pushdown: Using a rope attachment on a cable machine, push down, extending arms and then return.",
    "Long Explanation": "The Rope Pushdown is a weight training exercise targeting the Triceps. It involves using Cable machine with rope attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Rope+Pushdown"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Tricep Machine Press",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Tricep press machine",
    "Explaination": "Tricep Machine Press: Use a tricep press machine, push the weight down until arms are fully extended.",
    "Long Explanation": "The Tricep Machine Press is a weight training exercise targeting the Triceps. It involves using Tricep press machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Tricep+Machine+Press"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Bench Dips",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Bench",
    "Explaination": "Bench Dips: Using a bench or chair, lower your body by bending your arms and then push back up.",
    "Long Explanation": "The Bench Dips is a weight training exercise targeting the Triceps. It involves using Bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Bench+Dips"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Resistance Band Tricep Extension",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Resistance band",
    "Explaination": "Resistance Band Tricep Extension: Use a resistance band, extend your arms down or overhead, focusing on triceps.",
    "Long Explanation": "The Resistance Band Tricep Extension is a weight training exercise targeting the Triceps. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Tricep+Extension"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Kettlebell Overhead Extension",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Kettlebell",
    "Explaination": "Kettlebell Overhead Extension: Hold a kettlebell with both hands, extend arms overhead, then bend and straighten elbows.",
    "Long Explanation": "The Kettlebell Overhead Extension is a weight training exercise targeting the Triceps. It involves using Kettlebell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Kettlebell+Overhead+Extension"
  },
  {
    "Muscles": "Triceps",
    "WorkOut": "Tricep Push-Up",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Tricep Push-Up: Similar to a standard push-up but with hands closer to work the triceps more intensely.",
    "Long Explanation": "The Tricep Push-Up is a weight training exercise targeting the Triceps. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Tricep+Push-Up"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Bench Press",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell and bench",
    "Explaination": "Bench Press: Lie on a bench, press a barbell up from your chest, then lower it back down.",
    "Long Explanation": "The Bench Press is a weight training exercise targeting the Chest. It involves using Barbell and bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Bench+Press"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Push-Ups",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Push-Ups: Keep your body straight and lower it to the ground by bending your arms, then push back up.",
    "Long Explanation": "The Push-Ups is a weight training exercise targeting the Chest. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Push-Ups"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Incline Bench Press",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell and incline bench",
    "Explaination": "Incline Bench Press: Perform a bench press on an inclined bench to target the upper chest.",
    "Long Explanation": "The Incline Bench Press is a weight training exercise targeting the Chest. It involves using Barbell and incline bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Incline+Bench+Press"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Decline Bench Press",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell and decline bench",
    "Explaination": "Decline Bench Press: Use a decline bench for bench pressing, focusing on the lower chest.",
    "Long Explanation": "The Decline Bench Press is a weight training exercise targeting the Chest. It involves using Barbell and decline bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Decline+Bench+Press"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Dumbbell Flyes",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbells and a bench",
    "Explaination": "Dumbbell Flyes: Lie on a bench, extend arms with dumbbells, and bring them together in an arc motion.",
    "Long Explanation": "The Dumbbell Flyes is a weight training exercise targeting the Chest. It involves using Dumbbells and a bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Dumbbell+Flyes"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Cable Crossovers",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Cable machine with pulley system",
    "Explaination": "Cable Crossovers: Stand between two cable stations, pull handles together in front of you in a hugging motion.",
    "Long Explanation": "The Cable Crossovers is a weight training exercise targeting the Chest. It involves using Cable machine with pulley system, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Cable+Crossovers"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Chest Press Machine",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Chest press machine",
    "Explaination": "Chest Press Machine: Sit on the machine, push the bars or handles forward, then bring them back towards the chest.",
    "Long Explanation": "The Chest Press Machine is a weight training exercise targeting the Chest. It involves using Chest press machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Chest+Press+Machine"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Pec Deck Machine",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Pec deck machine",
    "Explaination": "Pec Deck Machine: Sit with arms on the pads and bring them together in front of you.",
    "Long Explanation": "The Pec Deck Machine is a weight training exercise targeting the Chest. It involves using Pec deck machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Pec+Deck+Machine"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Dips for Chest",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Parallel bars",
    "Explaination": "Dips for Chest: Perform dips with a forward lean to emphasize the chest muscles.",
    "Long Explanation": "The Dips for Chest is a weight training exercise targeting the Chest. It involves using Parallel bars, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Dips+for+Chest"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Svend Press",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Plates or dumbbells",
    "Explaination": "Svend Press: Hold plates between your hands and press them together in front of your chest, then push forward.",
    "Long Explanation": "The Svend Press is a weight training exercise targeting the Chest. It involves using Plates or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Svend+Press"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Single-Arm Dumbbell Bench Press",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbell and bench",
    "Explaination": "Single-Arm Dumbbell Bench Press: Lie on a bench and press a dumbbell with one arm, alternating sides.",
    "Long Explanation": "The Single-Arm Dumbbell Bench Press is a weight training exercise targeting the Chest. It involves using Dumbbell and bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Single-Arm+Dumbbell+Bench+Press"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Floor Press",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell and bench",
    "Explaination": "Floor Press: Similar to a bench press but performed lying on the floor, limiting the range of motion.",
    "Long Explanation": "The Floor Press is a weight training exercise targeting the Chest. It involves using Barbell and bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Floor+Press"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Plyometric Push-Up",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Plyometric Push-Up: Explosive push-ups, where you push off the ground to lift your hands, then land back in a push-up.",
    "Long Explanation": "The Plyometric Push-Up is a weight training exercise targeting the Chest. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Plyometric+Push-Up"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Resistance Band Chest Press",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Resistance band",
    "Explaination": "Resistance Band Chest Press: Wrap a resistance band around your back and press forward as if bench pressing.",
    "Long Explanation": "The Resistance Band Chest Press is a weight training exercise targeting the Chest. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Chest+Press"
  },
  {
    "Muscles": "Chest",
    "WorkOut": "Staggered Push-Up",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Staggered Push-Up: Perform push-ups with one hand forward and the other back, alternating the position each rep.",
    "Long Explanation": "The Staggered Push-Up is a weight training exercise targeting the Chest. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Staggered+Push-Up"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Deadlift",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell",
    "Explaination": "Deadlift: Lift a barbell or weights from the ground to hip level, keeping your back straight and driving with your legs.",
    "Long Explanation": "The Deadlift is a weight training exercise targeting the Back. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Deadlift"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Pull-Ups",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Pull-up bar",
    "Explaination": "Pull-Ups: Grip a bar with palms facing away and pull your body up until your chin is over the bar.",
    "Long Explanation": "The Pull-Ups is a weight training exercise targeting the Back. It involves using Pull-up bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Pull-Ups"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Bent-Over Barbell Row",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell",
    "Explaination": "Bent-Over Barbell Row: Bend at the waist, hold a barbell with both hands and pull it towards your lower chest or abdomen.",
    "Long Explanation": "The Bent-Over Barbell Row is a weight training exercise targeting the Back. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Bent-Over+Barbell+Row"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Lat Pulldown",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Cable machine with lat pulldown bar",
    "Explaination": "Lat Pulldown: Sit at a lat pulldown machine, pull the bar down towards your chest while keeping your back straight.",
    "Long Explanation": "The Lat Pulldown is a weight training exercise targeting the Back. It involves using Cable machine with lat pulldown bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Lat+Pulldown"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Seated Cable Row",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Cable machine",
    "Explaination": "Seated Cable Row: Sit at a cable row station, pull the handle towards your waist while keeping your back straight.",
    "Long Explanation": "The Seated Cable Row is a weight training exercise targeting the Back. It involves using Cable machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Seated+Cable+Row"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Single-Arm Dumbbell Row",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbell",
    "Explaination": "Single-Arm Dumbbell Row: Bend over at the waist, use one hand to row a dumbbell, keeping your back parallel to the floor.",
    "Long Explanation": "The Single-Arm Dumbbell Row is a weight training exercise targeting the Back. It involves using Dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Single-Arm+Dumbbell+Row"
  },
  {
    "Muscles": "Back",
    "WorkOut": "T-Bar Row",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell and T-bar row machine or landmine attachment",
    "Explaination": "T-Bar Row: Straddle a barbell, lift it using a T-bar attachment or handle, keeping your back straight.",
    "Long Explanation": "The T-Bar Row is a weight training exercise targeting the Back. It involves using Barbell and T-bar row machine or landmine attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=T-Bar+Row"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Inverted Row",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Bar or Smith machine",
    "Explaination": "Inverted Row: Lie under a bar, pull your chest up to the bar with feet planted on the ground.",
    "Long Explanation": "The Inverted Row is a weight training exercise targeting the Back. It involves using Bar or Smith machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Inverted+Row"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Back Extension",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Back extension bench",
    "Explaination": "Back Extension: Use a back extension bench to lift your upper body up and down, focusing on lower back muscles.",
    "Long Explanation": "The Back Extension is a weight training exercise targeting the Back. It involves using Back extension bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Back+Extension"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Machine Row",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Rowing machine",
    "Explaination": "Machine Row: Sit at a row machine, pull the handles towards your torso, focusing on your middle back.",
    "Long Explanation": "The Machine Row is a weight training exercise targeting the Back. It involves using Rowing machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Machine+Row"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Chin-Up",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Pull-up bar",
    "Explaination": "Chin-Up: Grip a bar with palms facing towards you and pull up until your chin is over the bar, focusing on your upper back.",
    "Long Explanation": "The Chin-Up is a weight training exercise targeting the Back. It involves using Pull-up bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Chin-Up"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Renegade Row",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbells",
    "Explaination": "Renegade Row: In a plank position with dumbbells, row one dumbbell up while stabilizing your body with the other arm.",
    "Long Explanation": "The Renegade Row is a weight training exercise targeting the Back. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Renegade+Row"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Resistance Band Pull Apart",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Resistance band",
    "Explaination": "Resistance Band Pull Apart: Hold a resistance band in front of you and pull it apart horizontally, focusing on your rear shoulders and upper back.",
    "Long Explanation": "The Resistance Band Pull Apart is a weight training exercise targeting the Back. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Pull+Apart"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Hyperextension",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Hyperextension bench",
    "Explaination": "Hyperextension: On a hyperextension bench, lift and lower your upper body, targeting your lower back.",
    "Long Explanation": "The Hyperextension is a weight training exercise targeting the Back. It involves using Hyperextension bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Hyperextension"
  },
  {
    "Muscles": "Back",
    "WorkOut": "Face Pull",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Cable machine with rope or handle attachment",
    "Explaination": "Face Pull: Use a cable machine with a rope attachment, pull towards your face while keeping your elbows high.",
    "Long Explanation": "The Face Pull is a weight training exercise targeting the Back. It involves using Cable machine with rope or handle attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Face+Pull"
  },
  {
    "Muscles": "Legs",
    "WorkOut": "Squat",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell or dumbbells",
    "Explaination": "Squat: Stand with feet shoulder-width apart, bend knees to lower your body as if sitting back, then stand up.",
    "Long Explanation": "The Squat is a weight training exercise targeting the Legs. It involves using Barbell or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Squat"
  },
  {
    "Muscles": "Legs",
    "WorkOut": "Deadlift",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Barbell",
    "Explaination": "Deadlift: Bend at your hips and knees to lower and grab a barbell, then stand up, lifting the weight.",
    "Long Explanation": "The Deadlift is a weight training exercise targeting the Legs. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Deadlift"
  },
  {
    "Muscles": "Legs",
    "WorkOut": "Lunges",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": "Dumbbells",
    "Explaination": "Lunges: Step forward with one foot and lower your body until both knees are bent at 90 degrees.",
    "Long Explanation": "The Lunges is a weight training exercise targeting the Legs. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Lunges"
  },
  {
    "Muscles": "Stretching",
    "WorkOut": "Cat-Cow Stretch",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Child's Pose: Kneel and sit on your heels, then lean forward with arms extended in front to stretch your back.",
    "Long Explanation": "The Cat-Cow Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Cat-Cow+Stretch"
  },
  {
    "Muscles": "Stretching",
    "WorkOut": "Child's Pose",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Lying Quad Stretch: Lie on one side, pull your top legs ankle toward your glutes.",
    "Long Explanation": "The Child's Pose is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Child's+Pose"
  },
  {
    "Muscles": "Stretching",
    "WorkOut": "Lying Quad Stretch",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Lying Figure-4 Stretch: Lie on your back, cross one ankle over the opposite knee, and gently pull the uncrossed leg towards you.",
    "Long Explanation": "The Lying Quad Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Lying+Quad+Stretch"
  },
  {
    "Muscles": "Stretching",
    "WorkOut": "Lying Figure-4 Stretch",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Neck Stretch: Gently tilt your head towards each shoulder and hold for a few seconds.",
    "Long Explanation": "The Lying Figure-4 Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Lying+Figure-4+Stretch"
  },
  {
    "Muscles": "Stretching",
    "WorkOut": "Neck Stretch",
    "Intensity_Level": "Beginner",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Gently tilt your head towards each shoulder, holding the stretch for a few seconds to relieve tension and improve flexibility in the neck muscles. Avoid forcing the movement and keep the stretch comfortable.",
    "Long Explanation": "The Neck Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Neck+Stretch"
  },
  {
    "Muscles": "Warm Up",
    "WorkOut": "Jogging in Place",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Jogging in Place: A simple way to elevate your heart rate.",
    "Long Explanation": "The Jogging in Place is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Jogging+in+Place"
  },
  {
    "Muscles": "Warm Up",
    "WorkOut": "Jumping Jacks",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Jumping Jacks: A full-body movement that increases your heart rate and warms up your muscles.",
    "Long Explanation": "The Jumping Jacks is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Jumping+Jacks"
  },
  {
    "Muscles": "Warm Up",
    "WorkOut": "Arm Circles",
    "Intensity_Level": "Expert",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Arm Circles: Great for warming up shoulders and arms.",
    "Long Explanation": "The Arm Circles is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
    "Video": "https://www.youtube.com/results?search_query=Arm+Circles"
  },
  {
    "Muscles": "Glutes",
    "WorkOut": "Bulgarian Split Squats",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Improves strength and balance in the legs and glutes, with a focus on each leg individually.",
    "Long Explanation": "Stand a few feet in front of a bench. Place one foot on the bench behind you. Lower your body until the front thigh is parallel to the floor. Stand back up.",
    "Video": "https://www.youtube.com/results?search_query=Bulgarian+Split+Squats"
  },
  {
    "Muscles": "Glutes",
    "WorkOut": "Donkey Kicks",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Strengthens the glutes, improving lower body power and stability.",
    "Long Explanation": "Get on all fours. Kick one leg back and up, squeezing your glutes. Return to the starting position.",
    "Video": "https://www.youtube.com/results?search_query=Donkey+Kicks"
  },
  {
    "Muscles": "Glutes",
    "WorkOut": "Cable Kickbacks",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Targets the glutes, enhancing strength and definition in the posterior chain.",
    "Long Explanation": "Attach a cable to an ankle strap. Kick your leg back, squeezing your glutes. Return to the starting position.",
    "Video": "https://www.youtube.com/results?search_query=Cable+Kickbacks"
  },
  {
    "Muscles": "Glutes",
    "WorkOut": "Glute Kickback Machine",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Isolates the glutes, providing focused strength and muscular development.",
    "Long Explanation": "Stand behind a glute kickback machine. Place one foot against the footpad. Kick your leg back, squeezing your glutes. Return to the starting position.",
    "Video": "https://www.youtube.com/results?search_query=Glute+Kickback+Machine"
  },
  {
    "Muscles": "Glutes",
    "WorkOut": "Barbell Hip Thrust",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Strengthens the glutes and hamstrings, enhancing overall lower body power.",
    "Long Explanation": "Sit on a bench with your upper back and shoulders supported. Place a barbell across your hips. Lift your hips by squeezing your glutes, raising the barbell. Lower back down.",
    "Video": "https://www.youtube.com/results?search_query=Barbell+Hip+Thrust"
  },
  {
    "Muscles": "Glutes",
    "WorkOut": "Single-Leg Deadlift",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Improves balance, core stability, and strength in the hamstrings and glutes.",
    "Long Explanation": "Stand on one leg with a dumbbell in your hand. Bend forward at the hips, keeping your back straight. Stand back up.",
    "Video": "https://www.youtube.com/results?search_query=Single-Leg+Deadlift"
  },
  {
    "Muscles": "Glutes",
    "WorkOut": "Step-Ups",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Strengthens the lower body and core, improving balance and muscular endurance.",
    "Long Explanation": "Stand in front of a bench. Step up onto the bench with one leg, then step back down.",
    "Video": "https://www.youtube.com/results?search_query=Step-Ups"
  },
  {
    "Muscles": "Glutes",
    "WorkOut": "Romanian Deadlift",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Strengthens the hamstrings and glutes, improving posterior chain strength.",
    "Long Explanation": "Stand with feet shoulder-width apart. Hold a barbell. Bend at the hips and knees slightly, then stand back up.",
    "Video": "https://www.youtube.com/results?search_query=Romanian+Deadlift"
  },
  {
    "Muscles": "Glutes",
    "WorkOut": "Kettlebell Swing",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Builds power and strength in the hips and legs, enhancing athletic performance.",
    "Long Explanation": "Stand with feet shoulder-width apart. Swing a kettlebell between your legs, then thrust your hips forward to swing the kettlebell up to chest height.",
    "Video": "https://www.youtube.com/results?search_query=Kettlebell+Swing"
  },
  {
    "Muscles": "Glutes",
    "WorkOut": "Side Lunge",
    "Intensity_Level": "Intermediate",
    "Beginner Sets": "3 Sets with 12 to 15 reps",
    "Intermediate Sets": "4 Sets with 8 to 12 reps",
    "Expert Sets": "5 Sets with 3 to 10 reps",
    "Equipment": null,
    "Explaination": "Enhances leg strength and stability, focusing on the glutes and inner thighs.",
    "Long Explanation": "Step to the side and lower your body, bending the knee of the leading leg while keeping the other leg straight. Return to the starting position.",
    "Video": "https://www.youtube.com/results?search_query=Side+Lunge"
  }
]
